export type Client = {
  id: number;
  name: string;
  logo: string;
  images: string[]; // كل عميل ممكن يكون له صورة واحدة أو أكثر
  description: string;
};

export const CLIENTS: Client[] = [
  {
    id: 1,
    name: "Dr. Greiche Glass",
    logo: "/dr-greiche-logo.png",
    images: [
     
    ],
    description:
      "شركة رائدة في صناعة ومعالجة الزجاج، تقدم حلولًا مبتكرة وعالية الجودة لزجاج السيارات والمباني والقطاعات الصناعية وفقًا لأعلى المعايير العالمية.",
  },
  {
    id: 2,
    name: "EGY LED",
    logo: "/egy-led-logo.png",
    images: ["/egy-led1.jpeg", "/egy-led2.jpeg", "/egy-led3.jpeg", "/video-egy-led.mp4"],
    description:
      "شركة متخصصة في توفير وتصنيع حلول شاشات LED واللوحات الإعلانية الرقمية، تقدم منتجات عالية الجودة وتقنيات عرض متطورة تناسب الاستخدامات التجارية والإعلانية والفعاليات، مع خدمات تركيب ودعم فني متكاملة.",
  },
  {
    id: 3,
    name: "MOG",
    logo: "/mog-logo.png",
    images: [],
    description:
      "شركة متخصصة في توريد وتجهيز معدات المطابخ التجارية والمطاعم والفنادق، وتقدم حلولًا متكاملة تشمل أحدث المعدات الاحترافية التي تجمع بين الجودة والكفاءة لتلبية احتياجات قطاع الضيافة والخدمات الغذائية.",
  },
  {
    id: 4,
    name: "Agrina Tec",
    logo: "/agrina-logo.png",
    images: [
   
    ],
    description:
      "شركة متخصصة في التصنيع الغذائي للمنتجات الزراعية، تقدم حلولًا متكاملة في إنتاج وتوزيع المركزات والمجمدات بجودة عالية، مع الالتزام بأعلى معايير الجودة والسلامة والاستدامة لتلبية احتياجات قطاع الأغذية والمشروبات محليًا وعالميًا.",
  },
  {
    id: 5,
    name: "NEGIDA",
    logo: "/negida-logo.png",
    images: [
 
    ],
    description:
      "نجيدة للمقاولات شركة متخصصة في أعمال المقاولات العامة والإنشاءات، تقدم حلولًا هندسية متكاملة تشمل تنفيذ مشروعات البنية التحتية والطرق والأعمال المدنية، مع الالتزام بأعلى معايير الجودة والسلامة وإنجاز المشاريع بكفاءة وفي الوقت المحدد.",
  },
  {
    id: 6,
    name: "CHP",
    logo: "/chp-logo-removebg-preview.png",
    images: ["/chp1.jpeg", "/chp2.jpeg", "/chp3.jpeg", "/chp4.jpeg", "/chp5.jpeg"],
    description:
      "شركة القناة للموانئ والمشروعات الكبرى (CHP)، إحدى شركات هيئة قناة السويس، تأسست عام 1965 وتُعد من الكيانات الرائدة في مجال أعمال التكريك والإنشاءات البحرية والموانئ والأعمال المدنية، وتقدم حلولًا هندسية متكاملة تشمل تنفيذ مشروعات البنية التحتية البحرية والموانئ، مع الالتزام بأعلى معايير الجودة والسلامة وإنجاز المشاريع بكفاءة وفي الوقت المحدد.",
  },
];